---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalLoadClassification.PanelConnectedCurrentLabel
source: html/6fba9d40-590f-3e3b-aaac-3a354d69c2a0.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalLoadClassification.PanelConnectedCurrentLabel Property

The name template for the connected current parameter on the load classification.

## Syntax (C#)
```csharp
public string PanelConnectedCurrentLabel { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: panelConnectedCurrentLabel is not a valid globalization format string.
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null